#Если Клиент Тогда
//ирПортативный Перем ирПортативный Экспорт;
//ирПортативный Перем ирОбщий Экспорт;
//ирПортативный Перем ирСервер Экспорт;
//ирПортативный Перем ирКэш Экспорт;
//ирПортативный Перем ирКлиент Экспорт;
Перем мБраузер Экспорт; /// Кэш
Перем мЛиПроверочный; // Булево
Перем мОписаниеЗадания; // см. ирКлиент.ОписаниеФоновогоЗаданияФормыЛкс
Перем мЛиПотоковый;
Перем мЛиВключитьИнструменты;
Перем мНакопленныйОтвет;
Перем мНакопленныйЗапрос;

Перем мПлатформа;
Перем мКонтекстВызоваИнструментов;
Перем мПолеТекстаПрограммы Экспорт;

Функция Браузер() Экспорт
	Возврат мБраузер._1CAPI; /// Добавка нужна для поддержки 8.3.25-
КонецФункции

// Ответ нужно ловить в обработчике onclick браузера.
// Отменяет текущий активный запрос.
// Параметры:
//   Адрес - Строка -
//   ТелоЗапросаСтрока - Строка -
//   Заголовки - Соответствие -
Процедура ОтправитьЗапрос(Знач Адрес, Знач ТелоЗапросаСтрока, Знач Заголовки, Знач ЛиПотоковый = Ложь, Знач ЛиПроверочный = Ложь, знач МинИнтервалОтветов = 500, Знач ЛиДозапрос = Ложь) Экспорт
	Если Не ирКэш.ДоступноБраузерWebKitЛкс() Тогда
		Возврат;
	КонецЕсли;
	мЛиПроверочный = ЛиПроверочный;
	ЗаголовкиМассив = Новый Массив;
	Для Каждого ЗаголовкиЭлемент Из Заголовки Цикл
		ЗаголовкиМассив.Добавить(Новый Структура("name,value", ЗаголовкиЭлемент.Ключ, ЗаголовкиЭлемент.Значение));
	КонецЦикла;
	ЗаголовкиТекст = ирОбщий.ОбъектВТекстЖСОНЛкс(ЗаголовкиМассив);
	Если Не ЛиДозапрос Тогда
		мНакопленныйОтвет = "";
	ИначеЕсли ЗначениеЗаполнено(мНакопленныйОтвет) Тогда
		мНакопленныйОтвет = мНакопленныйОтвет + Символы.ПС;
	КонецЕсли;
	мНакопленныйЗапрос = Неопределено;
	мЛиПотоковый = ЛиПотоковый;
	Если мЛиПотоковый Тогда
		Браузер().sendStreamRequest(Адрес, ТелоЗапросаСтрока, ЗаголовкиТекст, МинИнтервалОтветов);
	Иначе
		Браузер().sendHttpRequest(Адрес, ТелоЗапросаСтрока, ЗаголовкиТекст);
	КонецЕсли;
КонецПроцедуры

Функция ЛиПотокЗавершен() Экспорт
	Возврат Браузер().isStreamCompleted();
КонецФункции

// Не поддерживает поток
Функция ЛиЗапросВыполняется() Экспорт
	Возврат Браузер().isActiveHttpRequest();
КонецФункции

Функция СтатусЗапроса() Экспорт
	Возврат Браузер().getRequestStatus();
КонецФункции

// Читает и удаляет полученную часть ответа
Функция ПрочитатьЧастьОтвета() Экспорт
	Возврат Браузер().getAndClearAllData();
КонецФункции

Процедура ОтменитьЗапрос() Экспорт
	Если Не ирКэш.ДоступноБраузерWebKitЛкс() Тогда
		Возврат;
	КонецЕсли;
	Браузер().cancelCurrentRequest();
КонецПроцедуры

// Отправляет запрос к ИИ через OpenAPI. Ответ приходит событием onclick
// Параметры:
//   ПараметрыЗапроса - Структура, Массив - Содержимое сообщения, Массив для дозапросов
//    *Текст - Строка - текст запроса
//   Форма - Форма -
//   ОбработчикОтвета -  -
//   БлокируемыеЭлементы -  -
//   Кнопка - Кнопка -
//   ЛиПроверочный - Булево -
//   РежимНапарника - Строка - docstring, explain, review, modify, custom, system, raw
//   КлючСервиса - Строка - Ключ API для аутентификации
//   Сервер - Строка - URL-адрес API, опционально, по умолчанию - OpenRouter
//   Модель - Строка - Название модели, опционально, по умолчанию - deepseek/deepseek-chat
// Возвращаемое значение:
//   Булево - успешность запуска
Функция ОтправитьЗапросИИ(Знач ПараметрыЗапроса, Знач Форма = Неопределено, Знач ОбработчикОтвета = "", Знач БлокируемыеЭлементы = Неопределено, Знач Кнопка = Неопределено,
		Знач ЛиПотоковый = Ложь, Знач ЛиПроверочный = Ложь, Знач РежимНапарника = "custom", Знач КлючСервиса = Неопределено, Знач Сервер = Неопределено, Знач Модель = Неопределено,
		Знач ПараметрыМоделиИИ = Неопределено, Знач ВключитьИнструменты = Ложь, Знач УИДОтвета = Неопределено) Экспорт
	Если Не ирКэш.ДоступноБраузерWebKitЛкс() Тогда
		ирОбщий.СообщитьЛкс("Для отправки запроса к ИИ требуется платформа 8.3.14+");
		Возврат Ложь;
	КонецЕсли;
	Сервер = мПлатформа.СерверИИ(, Сервер);
	Модель = мПлатформа.МодельИИ(, Модель, Сервер);
	Если Ложь
		Или КлючСервиса = Неопределено
		Или КлючСервиса = "" И мПлатформа.ЛиНапарникВРолиОбщегоИИ(Сервер)
	Тогда
		КлючСервиса = мПлатформа.КлючСервисаИИ(Сервер);
	КонецЕсли;
	Если ПустаяСтрока(КлючСервиса) Тогда
		Если Не ЛиПроверочный Тогда
			#Если Клиент Тогда
				Форма = ирКлиент.ОткрытьНастройкиПоляПрограммыЛкс("", Истина, "КлючСервисаИИ");
			#КонецЕсли
		КонецЕсли;
		ВызватьИсключение "Не указан ключ сервиса ИИ";
	КонецЕсли;
	ЛиДозапрос = УИДОтвета <> Неопределено;
	Если мОписаниеЗадания <> Неопределено Тогда
		ОтменитьЗапрос();
		Если Не ЛиДозапрос Тогда
			ирКлиент.ОтменитьЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
			мОписаниеЗадания = Неопределено;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ЛиДозапрос Тогда
		Роль = "tool";
	Иначе
		Роль = "user";
		мОписаниеЗадания = ирКлиент.ОписаниеФоновогоЗаданияФормыЛкс("ЗапросИИ",, ПараметрыЗапроса,, Кнопка, ОбработчикОтвета,,, БлокируемыеЭлементы,,,,, Ложь);
		ирКлиент.ЗапуститьИлиОтменитьФоновоеЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
	КонецЕсли; 
	мЛиВключитьИнструменты = ВключитьИнструменты;
	Если Сервер = "https://code.1c.ai" Тогда
		// Для анализа трафика EDT Импорт сертификата Fiddler: 
		// keytool.exe -import -alias fiddler -file "%USERPROFILE%\Desktop\FiddlerRoot.cer" -keystore "C:\Program Files\1C\1CE\components\<jdk>\lib\security\cacerts" -storepass changeit -noprompt
		//Если РежимНапарника = "custom" Тогда
		//КонецЕсли;
		ПолеТекстаПрограммы = ирКэш.ПолеТекстаПрограммы();
		Соединение = ПолеТекстаПрограммы.СоединениеНапарника();
		Если ТипЗнч(Соединение) = Тип("Строка") Тогда
			ирОбщий.СообщитьЛкс(ирОбщий.СтрШаблонЛкс("Ошибка соединения с Напарником: %1", Соединение));
			ирКлиент.ОтменитьЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
			мОписаниеЗадания = Неопределено;
			Возврат Ложь;
		КонецЕсли;
		Заголовки = ПолеТекстаПрограммы.ЗаголовкиЗапросаНапарника(КлючСервиса);
		Если ЛиДозапрос Тогда
			Содержание = ПараметрыЗапроса;
		Иначе
			ПараметрыЧатаНапарника = Новый Структура;
			ПараметрыЧатаНапарника.Вставить("instruction", ПараметрыЗапроса.Текст);
			ПараметрыЧатаНапарника.Вставить("tools");
			Если мЛиВключитьИнструменты Тогда
				// Похоже он использует только фиксированные имена инструментов
				ПараметрыЧатаНапарника.Вставить("tools", СписокИнструментов());
			КонецЕсли;
			Запрос = ирОбщий.ЗапросHTTPЛкс("/chat_api/v1/conversations/");
			Запрос.Заголовки = Заголовки;
			СтруктураЗапроса = Новый Структура;
			СтруктураЗапроса.Вставить("tool_name", РежимНапарника);
			СтруктураЗапроса.Вставить("skill_name", РежимНапарника);
			СтруктураЗапроса.Вставить("is_chat", Истина);
			СтруктураЗапроса.Вставить("programming_language", "1с");
			СтруктураЗапроса.Вставить("ui_language", "russian");
			СтруктураЗапроса.Вставить("script_language", ПолеТекстаПрограммы.ИмяЯзыкаЧеловека());
			Запрос.УстановитьТелоИзСтроки(ирОбщий.ОбъектВТекстЖСОНЛкс(СтруктураЗапроса));
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			Если Не ирОбщий.ЛиУспешныйОтветHTTPЛкс(Ответ) Тогда
				ирОбщий.СообщитьЛкс(ирОбщий.СтрШаблонЛкс("Ошибка %1: %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку()));
				ирКлиент.ОтменитьЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
				мОписаниеЗадания = Неопределено;
				Возврат Ложь;
			КонецЕсли;
			СтруктураОтвета = ирОбщий.ОбъектИзТекстаЖСОНЛкс(Ответ.ПолучитьТелоКакСтроку()); // см. ПрочитатьJSON(ОбразецОтветаСозданияЧатаНапарника())
			Адрес = "https://code.1c.ai/chat_api/v1/conversations/" + СтруктураОтвета.uuid + "/messages";
			Содержание = Новый Структура("content", ПараметрыЧатаНапарника);
		КонецЕсли;
		СтруктураЗапроса = Новый Структура;
		//"tool_content": ...
		СтруктураЗапроса.Вставить("role", Роль);
		СтруктураЗапроса.Вставить("parent_uuid", УИДОтвета);
		//СтруктураЗапроса.Вставить("tool_content", ПараметрыЗапроса);
		СтруктураЗапроса.Вставить("content", Содержание);
	Иначе
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		//Заголовки.Вставить("Origin", "https://chat.deepseek.com");
		//Заголовки.Вставить("Referer", "https://chat.deepseek.com/");
		Если ЗначениеЗаполнено(КлючСервиса) Тогда
			Заголовки.Вставить("Authorization", "Bearer " + КлючСервиса);
		КонецЕсли;
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("model", Модель);
		Если ЛиДозапрос Тогда
			СтруктураЗапроса.Вставить("messages", мКонтекстВызоваИнструментов.Сообщения);
			Содержание = ПараметрыЗапроса;
		Иначе
			СтруктураЗапроса.Вставить("messages", Новый Массив);
			Если мЛиВключитьИнструменты Тогда
				//ЛиПотоковый = Ложь; // - Пока только в непотоковом режиме, чтобы не усложнять парсинг
				СтруктураЗапроса.Вставить("tools", СписокИнструментов());
				СтруктураЗапроса.Вставить("tool_choice", "auto");
			КонецЕсли;
			Содержание = ПараметрыЗапроса.Текст;
		КонецЕсли;
		СтруктураЗапроса.Вставить("stream", ЛиПотоковый);
		Если ПараметрыМоделиИИ = Неопределено Тогда
			ПараметрыМоделиИИ = мПлатформа.ПараметрыМоделиИИ();
		КонецЕсли;
		Для Каждого ЭлементСписка Из ПараметрыМоделиИИ Цикл
			Если Не ЭлементСписка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			Если Не ирОбщий.ЛиИмяПеременнойЛкс(ЭлементСписка.Представление) Тогда
				ирКлиент.ОткрытьНастройкиПоляПрограммыЛкс("", Истина, "ПараметрыМоделиИИ");
				ВызватьИсключение ирОбщий.СтрШаблонЛкс("Неверное имя параметра модели ИИ: %1", ЭлементСписка.Представление);
			КонецЕсли;
			ЗначениеПараметра = ЭлементСписка.Значение;
			Если ЭлементСписка.Представление = "reasoning" Тогда
				ЗначениеПараметра = Новый Структура("enable", ЗначениеПараметра);
			КонецЕсли;
			СтруктураЗапроса.Вставить(ЭлементСписка.Представление, ЗначениеПараметра);
		КонецЦикла;
		СтруктураСообщения = Новый Структура("role,content", Роль, Содержание);
		СтруктураЗапроса.messages.Добавить(СтруктураСообщения);
		Адрес = Сервер + "/v1/chat/completions";
	КонецЕсли;
	Если ЛиДозапрос Тогда
		Адрес = мКонтекстВызоваИнструментов.Адрес;
	Иначе
		мКонтекстВызоваИнструментов = НовыйКонтекстВызоваИнструментов(Заголовки, Адрес);
	КонецЕсли;
	ОтправитьЗапрос(Адрес, ирОбщий.ОбъектВТекстЖСОНЛкс(СтруктураЗапроса), Заголовки, ЛиПотоковый, ЛиПроверочный,, ЛиДозапрос);
	мКонтекстВызоваИнструментов.Сообщения.Добавить(СтруктураСообщения);
	Возврат Истина;
КонецФункции

Функция НовыйКонтекстВызоваИнструментов(Знач Заголовки, Знач Адрес) Экспорт
	КонтекстВызоваИнструментов = Новый Структура;
	КонтекстВызоваИнструментов.Вставить("Заголовки", Заголовки);
	КонтекстВызоваИнструментов.Вставить("Сообщения", Новый Массив);
	КонтекстВызоваИнструментов.Вставить("Итерация", 0);
	КонтекстВызоваИнструментов.Вставить("Адрес", Адрес);
	КонтекстВызоваИнструментов.Вставить("Дозапросы", Новый Массив); // Массив из см. НовоеОписаниеДозапроса
	Возврат КонтекстВызоваИнструментов;
КонецФункции

Функция ОбразецОтветаСозданияЧатаНапарника() Экспорт
	Возврат "{""uuid"":""028c6d0f-864f-4b2d-846b-6c8b161c4171""}";
КонецФункции

Функция ОбразецЧатЗапросНапарника() Экспорт
	Возврат "{
		|  ""parent_uuid"": null,
		|  ""tool_content"": {
		|    ""instruction"": ""напиши код расчета суммы по документу Документ1"",
		|    ""code"": [
		|      {
		|        ""content"": ""\r\n\r\nФункция СуммаМоя(Скидка) Экспорт\r\n\t\r\nКонецФункци"",
		|        ""path"": ""Тест_83_серверная/src/Documents/Документ1/ObjectModule.bsl"",
		|        ""path_formatted"": ""Документы→Документ1→Модуль объекта"",
		|        ""start_line"": 4,
		|        ""end_line"": 8
		|      }
		|    ]
		|  }
		|}"
КонецФункции
	
Функция ОбразецЧатОтветНапарника() Экспорт
	Возврат 
		"data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""role"":""user"",""create_time"":""2025-10-11T08:08:32.452288"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""role"":""user"",""create_time"":""2025-10-11T08:08:32.452288"",""finished"":true}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":""""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":"" Для расчета суммы по документу \""Документ1\"" нам необходимо знать структуру этого документа. Предпо""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":"" Для расчета суммы по документу \""Документ1\"" нам необходимо знать структуру этого документа. Предположим, что документ имеет табличную часть \""Товары\"" с колонками \""Количество\"" и \""Цена\"".""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":"" Для расчета суммы по документу \""Документ1\"" нам необходимо знать структуру этого документа. Предположим, что документ имеет табличную часть \""Товары\"" с колонками \""Количество\"" и \""Цена\"". Тогда функция расчета суммы с учетом скидки может выглядеть следующим образом:\n\n```1с\nФункция Су""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|"
КонецФункции
	
Функция ОбработатьОтвет(Форма) Экспорт
	Если Ложь
		Или мОписаниеЗадания = Неопределено
		Или мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.Отменено
	Тогда
		мОписаниеЗадания = Неопределено;
		Возврат "";
	КонецЕсли; 
	ТелоОтвета = СокрЛ(ПрочитатьЧастьОтвета());
	ЛиПотокЗавершен = Не мЛиПотоковый Или ЛиПотокЗавершен();
	ПрефиксЧастиОтвета = "data: ";
	Если ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, "Ошибка:") Тогда
		мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно;
	Иначе
		Если ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, "Отмена:") Тогда
			// Только для потокового режима
		ИначеЕсли ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, "Конец:") Тогда
			// Только для потокового режима
			ТелоОтвета = "";
		ИначеЕсли Ложь
			Или ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, ПрефиксЧастиОтвета)
			Или Найти(ТелоОтвета, Символы.ПС + ПрефиксЧастиОтвета)
		Тогда
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.УстановитьТекст(ТелоОтвета);
			Результат = Новый Массив;
			Для НомерСтроки = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
				СтрокаТекста = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
				Если ирОбщий.СтрНачинаетсяСЛкс(СтрокаТекста, ПрефиксЧастиОтвета) Тогда
					ТекстБезПервогоФрагмента = ирОбщий.ТекстБезПервогоФрагментаЛкс(СтрокаТекста, ПрефиксЧастиОтвета);
					Если ТекстБезПервогоФрагмента = "[DONE]" Тогда
						// openrouter.ai
						ЛиПотокЗавершен = Истина;
						Прервать;
					КонецЕсли;
					ЭлементСообщения = ирОбщий.ОбъектИзТекстаЖСОНЛкс(ТекстБезПервогоФрагмента);
					Если ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "content_delta") <> Неопределено Тогда
						// Напарник потоковый
						ВложеннаяЧасть = ЭлементСообщения.content_delta;
						Результат.Добавить(ВложеннаяЧасть.content);
						Если ирОбщий.СвойствоСтруктурыЛкс(ВложеннаяЧасть, "tool_calls") <> Неопределено Тогда
							ПрочитатьЧастьДопзапросов(ВложеннаяЧасть);
							Если ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "finished") = Истина Тогда
								// вызов инструментов — если ИИ вернул вызов инструмента, выполняем и продолжаем диалог
								Если ОбработатьВызовИнструмента(мНакопленныйЗапрос, ЭлементСообщения.uuid) Тогда
									ЛиПотокЗавершен = Ложь;
								КонецЕсли;
								мНакопленныйЗапрос = Неопределено;
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "content") <> Неопределено Тогда
						// Напарник непотоковый
						Если ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "finished") = Истина Тогда
							ЛиПотокЗавершен = Истина;
						КонецЕсли;
					ИначеЕсли Истина
						И ЭлементСообщения.Свойство("choices") 
						И ЭлементСообщения.choices.Количество() > 0
					Тогда
						// openrouter.ai
						ВложеннаяЧасть = ЭлементСообщения.choices[0].delta;
						Если ВложеннаяЧасть.Свойство("content") Тогда
							ЧастьОтвета = ВложеннаяЧасть.content;
							//ЧастьОтвета = ВложеннаяЧасть.reasoning;
							Результат.Добавить(ЧастьОтвета);
						КонецЕсли;
						Если ВложеннаяЧасть.Свойство("tool_calls") Тогда
							ПрочитатьЧастьДопзапросов(ВложеннаяЧасть);
						КонецЕсли;
						Если Истина
							И мНакопленныйЗапрос <> Неопределено
							И ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения.choices[0], "finish_reason") = "tool_calls" 
						Тогда
							// вызов инструментов — если ИИ вернул вызов инструмента, выполняем и продолжаем диалог
							Если ОбработатьВызовИнструмента(мНакопленныйЗапрос, ЭлементСообщения.id) Тогда
								ЛиПотокЗавершен = Ложь;
							КонецЕсли;
							мНакопленныйЗапрос = Неопределено;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ТелоОтвета = ирОбщий.СтрСоединитьЛкс(Результат, "");
			мНакопленныйОтвет = мНакопленныйОтвет + ТелоОтвета;
		Иначе
			Если ирОбщий.ЛиТекстJSONЛкс(ТелоОтвета) Тогда
				ОтветЖСОН = ирОбщий.ОбъектИзТекстаЖСОНЛкс(ТелоОтвета);
				Если Истина
					И ОтветЖСОН.Свойство("choices")
					И ОтветЖСОН.choices.Количество() > 0
				Тогда
					// сайта openrouter.ai
					// вызов инструментов — если ИИ вернул вызов инструмента, выполняем и продолжаем диалог
					Если ОтветЖСОН.choices[0].message.Свойство("tool_calls") Тогда
						Если ОбработатьВызовИнструмента(ОтветЖСОН.choices[0].message) Тогда
							ЛиПотокЗавершен = Ложь;
						КонецЕсли;
					КонецЕсли;
					мНакопленныйОтвет = ОтветЖСОН.choices[0].message.content; // Строка
				Иначе
					мНакопленныйОтвет = "";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЛиПотокЗавершен Тогда
			мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.Завершено;
		КонецЕсли;
	КонецЕсли; 
	Если Истина
		И ЛиПотокЗавершен
		И мКонтекстВызоваИнструментов.Дозапросы.Количество() > 0
	Тогда
		мНакопленныйОтвет = мНакопленныйОтвет + Символы.ПС + Символы.ПС + "== Все выполенные дозапросы:" + Символы.ПС;
		Для каждого Дозапрос Из мКонтекстВызоваИнструментов.Дозапросы Цикл
			ВывестиДозапросВТекст(Дозапрос);
		КонецЦикла;
	КонецЕсли;
	мОписаниеЗадания.Параметры.Вставить("Ответ", мНакопленныйОтвет);
	Если ЛиПотокЗавершен Тогда
		Если мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Если мЛиПроверочный Тогда
				ирОбщий.СообщитьЛкс(ТелоОтвета,,,, Ложь);
			Иначе
				мОписаниеЗадания.Параметры.Ответ = мОписаниеЗадания.Параметры.Ответ + Символы.ПС + ТелоОтвета;
			КонецЕсли;
		КонецЕсли;
		ирКлиент.ОбработатьЗавершениеЗаданияФормыЛкс(мОписаниеЗадания, Форма,,,, мОписаниеЗадания.Параметры);
		Длительность = ТекущаяДата() - мОписаниеЗадания.НачалоВыполнения;
		Если Истина
			И Не мЛиПотоковый
			И (Ложь
				Или мЛиПроверочный И мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.Завершено
				Или мЛиПроверочный И Длительность > 1
				Или Длительность > 5)
		Тогда
			ирОбщий.СообщитьЛкс("ИИ ответил за " + Длительность + " секунд",,, Истина, Ложь);
		КонецЕсли;
		мОписаниеЗадания = Неопределено;
	Иначе
		Если мОписаниеЗадания.ОбработчикЗавершения <> "" Тогда
			Состояние = мОписаниеЗадания.Состояние;
			Параметры = мОписаниеЗадания.Параметры;
			Выполнить("Форма." + мОписаниеЗадания.ОбработчикЗавершения + "(Состояние, Параметры)");
		КонецЕсли;
	КонецЕсли;
	Возврат мНакопленныйОтвет;
КонецФункции

Процедура ПрочитатьЧастьДопзапросов(Знач ЧастьСообщения) Экспорт
	Если мНакопленныйЗапрос = Неопределено Тогда
		мНакопленныйЗапрос = ЧастьСообщения;
	Иначе
		Для Каждого ЧастьДозапроса Из ЧастьСообщения.tool_calls Цикл
			Если мНакопленныйЗапрос.tool_calls.ВГраница() < ЧастьДозапроса.index Тогда
				мНакопленныйЗапрос.tool_calls.Добавить(ЧастьДозапроса);
			КонецЕсли;
			мНакопленныйЗапрос.tool_calls[ЧастьДозапроса.index].function.arguments = мНакопленныйЗапрос.tool_calls[ЧастьДозапроса.index].function.arguments + ЧастьДозапроса.function.arguments;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Инструменты

Функция ОбработатьВызовИнструмента(Знач СообщениеИИ, Знач УИДОтвета = "") Экспорт
	Если Не мЛиВключитьИнструменты Тогда
		Возврат Ложь;
	КонецЕсли;
	мКонтекстВызоваИнструментов.Итерация = мКонтекстВызоваИнструментов.Итерация + 1;
	Если мКонтекстВызоваИнструментов.Итерация > 5 Тогда
		ирОбщий.СообщитьЛкс("Превышен лимит итераций вызова инструментов");
		Возврат Ложь;
	КонецЕсли;
	ОтветыИнструментов = Новый Массив;
	Для Каждого ВызовИнструмента Из СообщениеИИ.tool_calls Цикл
		ИмяИнструмента = ВызовИнструмента.function.name;
		Аргументы = ВызовИнструмента.function.arguments;
		ПредставлениеРезультата = "";
		Попытка
			РезультатИнструмента = ВызватьИнструмент(ИмяИнструмента, Аргументы, ПредставлениеРезультата);
			Если РезультатИнструмента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(РезультатИнструмента) = Тип("Строка") Тогда
				ТекстРезультата = РезультатИнструмента;
			Иначе
				ТекстРезультата = ирОбщий.ОбъектВТекстЖСОНЛкс(РезультатИнструмента);
			КонецЕсли;
		Исключение
			ТекстРезультата = ирОбщий.СтрШаблонЛкс("Ошибка выполнения %1: %2", ИмяИнструмента, ОписаниеОшибки());
		КонецПопытки;
		ЕстьОтветы = Истина;
		ОтветИнструмента = Новый Структура;
		ОтветИнструмента.Вставить("tool_call_id", ВызовИнструмента.id);
		//ОтветИнструмента.Вставить("role", "tool");
		ЛиОбработанКлиентом = ЗначениеЗаполнено(ТекстРезультата);
		Если ЛиОбработанКлиентом Тогда
			ОтветИнструмента.Вставить("content", ТекстРезультата);
			ОтветИнструмента.Вставить("status", "rejected"); // Для серверного инструмента Напарника
		Иначе
			ОтветИнструмента.Вставить("content", Неопределено);
			ОтветИнструмента.Вставить("status", "accepted"); // Для серверного инструмента Напарника
		КонецЕсли;
		ОтветИнструмента.Вставить("name", ИмяИнструмента);
		ОтветыИнструментов.Добавить(ОтветИнструмента);
		ОписаниеДозапроса = НовоеОписаниеДозапроса(Аргументы, ИмяИнструмента, ТекстРезультата, ЛиОбработанКлиентом, ПредставлениеРезультата);
		ВывестиДозапросВТекст(ОписаниеДозапроса);
		мКонтекстВызоваИнструментов.Дозапросы.Добавить(ОписаниеДозапроса);
	КонецЦикла;
	Если ОтветыИнструментов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	ОтменитьЗапрос(); // Текущий отменяем. Один запрос одновременно.
	ОтправитьЗапросИИ(ОтветыИнструментов,,,,, мЛиПотоковый,,,,,,, Истина, УИДОтвета);
	Возврат Истина;
КонецФункции

Процедура ВывестиДозапросВТекст(Знач ОписаниеДозапроса) Экспорт
	АргументыТекстом = ?(ТипЗнч(ОписаниеДозапроса.аргументы) = Тип("Строка"), ОписаниеДозапроса.Аргументы, ирОбщий.ОбъектВТекстЖСОНЛкс(ОписаниеДозапроса.аргументы));
	АргументыТекстом = ирОбщий.ПредставлениеСОбрезкойДлиныЛкс(АргументыТекстом);
	ПредставлениеДозапроса = "<small>//дозапрос " + ?(ОписаниеДозапроса.ЛиОбработанКлиентом, "(клиент)", "(сервер)") + " " + ОписаниеДозапроса.Инструмент + "(" + АргументыТекстом + ")";
	Если ЗначениеЗаполнено(ОписаниеДозапроса.ПредставлениеРезультата) Тогда
		ПредставлениеДозапроса = ПредставлениеДозапроса + " - " + ОписаниеДозапроса.ПредставлениеРезультата;
	КонецЕсли;
	Если ОписаниеДозапроса.ОтправленоСимволов > 1000 Тогда
		ПредставлениеДозапроса = ПредставлениеДозапроса + " - "+ ОписаниеДозапроса.ОтправленоСимволов + " символов";
	КонецЕсли;
	ПредставлениеДозапроса = ПредставлениеДозапроса + "</small>";
	Если ЗначениеЗаполнено(мНакопленныйОтвет) Тогда
		ПредставлениеДозапроса = Символы.ПС + ПредставлениеДозапроса;
	КонецЕсли;
	мНакопленныйОтвет = мНакопленныйОтвет + ПредставлениеДозапроса;
КонецПроцедуры

//.
// Параметры:
//   Аргументы -  - 
//   ИмяИнструмента -  - 
//   ТекстРезультата - Произвольный, Строка - 
// Возвращаемое значение:
//    - 
Функция НовоеОписаниеДозапроса(Знач Аргументы, Знач ИмяИнструмента, Знач ТекстРезультата, Знач ЛиОбработанКлиентом, Знач ПредставлениеРезультата) Экспорт
	Результат = Новый Структура("Инструмент, Аргументы, ОтправленоСимволов, ЛиОбработанКлиентом, ПредставлениеРезультата", ИмяИнструмента, Аргументы, СтрДлина(ТекстРезультата), ЛиОбработанКлиентом, ПредставлениеРезультата);
	Возврат Результат;
КонецФункции

Функция СписокИнструментов() Экспорт
	Инструменты = Новый Массив;
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"platform_list_objects",
				"Список объектов (типов) платформы по имени",
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"platform_object",
				"Описание объекта (типа) платформы: методы, свойства, события",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("name",
						Новый Структура("type,description", "string", "имя объекта (типа) платформы (например 'Глобальный' или 'ТаблицаЗначений')")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"platform_object_member",
				"Описание метода/свойства объекта (типа) платформы по имени.",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("full_name, isMethod",
						Новый Структура("type,description", "string", "имя метода/свойства (например, 'СтрЗаменить' или 'ТаблицаЗначений.Колонки')"),
						Новый Структура("type,description", "boolean", "Является методом")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_list_objects",
				"Список объектов метаданных с фильтром по имени коллекции.",
				Новый Структура("type,properties", "object",
					Новый Структура("types",
						Новый Структура("type,description,items", "array", "Список множественных имен коллекций метаданных (например, 'Справочники','Документы'). Пусто = основные типы.", Новый Структура("type", "string"))
						)
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_list_common_modules",
				"Список общих модулей.",
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_object",
				"Описание объекта метаданных: формы, реквизиты, табличные части, модули.",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("full_name",
						Новый Структура("type,description", "string", "Полное имя метаданных")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_form",
				"Описание формы: элементы управления, реквизиты.",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("full_name",
						Новый Структура("type,description", "string", "Полное имя формы, например 'ОбщаяФорма.ФормаНастроек' или 'Справочник.Номенклатура.ФормаЭлемента'")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"module_list_methods",
				"Список методов модуля",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("module_name, exportedOnly",
						Новый Структура("type,description", "string", "Полное имя модуля (например 'Справочник.Номенклатура.МодульОбъекта' или 'ОбщийМодуль.ирОбщий')"),
						Новый Структура("type,description", "boolean", "Только экспортные"),
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"module_method",
				"Описание метода модуля",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("module_name,method_name",
						Новый Структура("type,description", "string", "Полное имя модуля"),
						Новый Структура("type,description", "string", "Имя метода")
						),
					Новый Массив
					)
				));
				
	// Напарник
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"mcp__syntax-checker__validate", // Прошито в Напарнике. Он не хочет другие имена использовать.
				"Проверка кода",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("code, use_context",
						Новый Структура("type,description", "string", "текст программы"),
						Новый Структура("type,description", "boolean", "использовать текущий контекст модуля")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"GetProjects", // Прошито в Напарнике. Он не хочет другие имена использовать.
				"Список проектов",
				));
	
	Возврат Инструменты;
КонецФункции

Функция НовоеОписаниеИнструмента(Знач Имя, Знач Описание, Знач ПараметрыЖСОН)
	Возврат Новый Структура("type,function",
			"function",
			Новый Структура("name,description,parameters", Имя, Описание, ПараметрыЖСОН)
			);
КонецФункции

Функция ВызватьИнструмент(Знач ИмяИнструмента, Знач Аргументы, ПредставлениеРезультата = "")
	Если мПолеТекстаПрограммы.мПлатформа = Неопределено Тогда
		мПолеТекстаПрограммы.ИнициироватьНеинтерактивно();
	КонецЕсли;
	// Аргументы приходит как Структура (если распарсили) либо как строка JSON
	Если ТипЗнч(Аргументы) = Тип("Строка") И ирОбщий.ЛиТекстJSONЛкс(Аргументы) Тогда
		Аргументы = ирОбщий.ОбъектИзТекстаЖСОНЛкс(Аргументы);
	КонецЕсли;
	Если Аргументы = Неопределено Тогда
		Аргументы = Новый Структура;
	КонецЕсли;
	Если ИмяИнструмента = "platform_list_objects" Тогда
		Возврат Инструмент_ПлатформаСписокОбъектов(Аргументы);
	ИначеЕсли ИмяИнструмента = "platform_object" Тогда
		Возврат Инструмент_ПлатформаОписаниеОбъекта(Аргументы);
	ИначеЕсли ИмяИнструмента = "platform_object_member" Тогда
		Возврат Инструмент_ПлатформаОписаниеСлова(Аргументы);
	ИначеЕсли ИмяИнструмента = "metadata_list_objects" Тогда
		Возврат Инструмент_МетаданныеСписокОбъектов(Аргументы);
	ИначеЕсли ИмяИнструмента = "metadata_list_common_modules" Тогда
		Возврат Инструмент_МетаданныеСписокОбщихМодулей();
	ИначеЕсли ИмяИнструмента = "metadata_object" Тогда
		Возврат Инструмент_МетаданныеОписаниеОбъекта(Аргументы.full_name);
	ИначеЕсли ИмяИнструмента = "metadata_form" Тогда
		Возврат Инструмент_ОписаниеФормы(Аргументы.full_name);
	ИначеЕсли ИмяИнструмента = "module_list_methods" Тогда
		Возврат Инструмент_СписокМетодов(Аргументы);
	ИначеЕсли ИмяИнструмента = "module_method" Тогда
		Возврат Инструмент_ОписаниеМетода(Аргументы);
	// EDT - похоже просто дублирует запущенные на сервере сессии инструментов, чтобы клиент мог показать индикаторы
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "GetProjects", Истина) Тогда
		Возврат ирОбщий.ЗначенияВМассивЛкс(Метаданные.Имя);
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "FindSimilar_in_Project", Истина) Тогда
		// Аргументы.synthetic_call_key = "Справочник Скидки";
		// Аргументы.synthetic_call_key = "CommonModules.*.СортироватьМассив";
		Возврат "";
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "Search_Documentation", Истина) Тогда
		// Аргументы.query = "Методы сортировки массива Сортировать";
		Возврат "";
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "SearchText", Истина) Тогда
		// Аргументы.query = "Методы сортировки массива Сортировать";
		Возврат "";
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "Search_ITS", Истина) Тогда
		// Аргументы.query = "Методы сортировки массива Сортировать";
		Возврат "";
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "SearchFiles", Истина) Тогда
		// Аргументы.query = "Методы сортировки массива Сортировать";
		Возврат "";
	ИначеЕсли ИмяИнструмента = "mcp__syntax-checker__validate" Тогда
		АнализаторКода = мПолеТекстаПрограммы.КопияКомпоненты();
		АнализаторКода.УстановитьТекст(Аргументы.code);
		АнализаторКода.ПроверитьВыраженияТекста(,,,,, Ложь);
		ТаблицаОшибок = АнализаторКода.ОшибкиМодуля.Выгрузить(, "ВыражениеРодитель, Позиция, Слово, ТипОшибки, ТипРодителя");
		Если ТаблицаОшибок.Количество() = 0 Тогда
			ПредставлениеРезультата = "Ошибок не найдено";
			Возврат ПредставлениеРезультата; // - Чтобы серверная проверка не выполнялась, нужен непустой результат
		Иначе
			мНакопленныйОтвет = "";
			ПредставлениеРезультата = ирОбщий.СтрШаблонЛкс("Найдено %1 ошибок, текст очищен", ТаблицаОшибок.Количество());
			Возврат ирОбщий.ТаблицаЗначенийВМассивЛкс(ТаблицаОшибок);
		КонецЕсли;
	Иначе
		//ВызватьИсключение "ИИ запросил неизвестный инструмент: " + ИмяИнструмента;
		Возврат "";
	КонецЕсли;
КонецФункции 

Функция Инструмент_СписокМетодов(Знач Аргументы) Экспорт
	Структура = Новый Структура;
	Если Аргументы.exportedOnly Тогда
		Структура.Вставить("ЛиЭкспорт", Истина);
	КонецЕсли;
	МодульПоИмени = МодульПоИмени(Аргументы.module_name);
	Массив = МодульПоИмени.Методы.Скопировать(Структура).ВыгрузитьКолонку("Имя");
	Возврат Массив;
КонецФункции

Функция МодульПоИмени(Знач ИмяМодуля) Экспорт
	МодульПоИмени = мПлатформа.ПолеТекстаМодуля(ИмяМодуля).мМодульМетаданных;
	Возврат МодульПоИмени;
КонецФункции

Функция Инструмент_ОписаниеМетода(Знач Аргументы) Экспорт
	МодульПоИмени = МодульПоИмени(Аргументы.module_name);
	СтрокаМетода = МодульПоИмени.Методы.Найти(НРег(Аргументы.method_name), "НИмя");
	Результат = мПолеТекстаПрограммы.МетодНапарника(СтрокаМетода, Аргументы.module_name);
	Возврат Результат;
КонецФункции

Функция Инструмент_ПлатформаСписокОбъектов(Знач Аргументы)
	Отбор = Новый Структура("ЯзыкПрограммы", 0);
	Возврат мПлатформа.ТаблицаОбщихТипов.Скопировать(Отбор).ВыгрузитьКолонку("БазовыйТип");
КонецФункции

Функция Инструмент_ПлатформаОписаниеОбъекта(Знач Аргументы)
	ОписаниеОбщегоТипа = мПлатформа.ОписаниеОбщегоТипа(Аргументы.name,, Истина);
	Таблица = мПлатформа.ТаблицаКонтекстов.Скопировать(Новый Структура("ТипКонтекста, ЯзыкПрограммы", ОписаниеОбщегоТипа.Слово, 0), "Слово, ТипСлова");
	//СинтаксПомощник = Обработки.ирСинтаксПомощник.Создать();
	//Результат = СинтаксПомощник.ТекстовоеОписаниеСлова(ОписаниеОбщегоТипа);
	Результат = ирОбщий.СтруктураИзСтрокиТаблицыИлиДереваИлиВыборкиЛкс(ОписаниеОбщегоТипа);
	Результат.Вставить("Члены", ирОбщий.ТаблицаЗначенийВМассивЛкс(Таблица));
	Возврат Результат;
КонецФункции

Функция Инструмент_ПлатформаОписаниеСлова(Знач Аргументы)
	ПолноеИмяСлова = Аргументы.full_name;
	Если ПустаяСтрока(ПолноеИмяСлова) Тогда
		ВызватьИсключение "full_name не задан";
	КонецЕсли;
	ЛиМетод = Аргументы.isMethod;
	ТипКонтекста = "Глобальный";
	Если Найти(ПолноеИмяСлова, ".") Тогда
		ТипКонтекста = ирОбщий.ПервыйФрагментЛкс(ПолноеИмяСлова);
	КонецЕсли;
	Слово = ирОбщий.ПоследнийФрагментЛкс(ПолноеИмяСлова);
	Отбор = Новый Структура("ТипКонтекста, Слово, ЯзыкПрограммы", ТипКонтекста, Слово, 0);
	СтрокаСлова = мПлатформа.ТаблицаКонтекстов.НайтиСтроки(Отбор)[0];
	СинтаксПомощник = Обработки.ирСинтаксПомощник.Создать();
	Результат = СинтаксПомощник.ТекстовоеОписаниеСлова(СтрокаСлова);
	Возврат Результат;
КонецФункции

Функция Инструмент_МетаданныеСписокОбъектов(Знач Аргументы)
	Типы = Неопределено;
	Если ЗначениеЗаполнено(Аргументы) Тогда
		Типы = ирОбщий.СвойствоСтруктурыЛкс(Аргументы, "types");
	КонецЕсли;
	Если Типы = Неопределено Или Типы.Количество() = 0 Тогда
		Типы = ирКэш.ТипыМетаОбъектов(Истина, Ложь, Истина).ВыгрузитьКолонку("Множественное");
	КонецЕсли;
	Результат = Новый Массив;
	Для Каждого ИмяКоллекции Из Типы Цикл
		Если ИмяКоллекции = "Перерасчеты" Тогда
			Продолжить;
		КонецЕсли;
		Коллекция = Метаданные[ИмяКоллекции];
		Для Каждого ОбъектМД Из Коллекция Цикл // ОбъектМетаданных
			Значение = Новый Структура;
			//Значение.Вставить("type", ИмяКоллекции);
			Значение.Вставить("name", ОбъектМД.Имя);
			Значение.Вставить("full_name", ОбъектМД.ПолноеИмя());
			Результат.Добавить(Значение);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция Инструмент_МетаданныеСписокОбщихМодулей()
	Результат = Новый Массив;
	Для Каждого МД Из Метаданные.ОбщиеМодули Цикл
		Структура = Новый Структура;
		Структура.Вставить("name", МД.Имя);
		Структура.Вставить("global", МД.Глобальный);
		Структура.Вставить("server", МД.Сервер);
		Структура.Вставить("serverCall", МД.ВызовСервера);
		Структура.Вставить("сashMode", МД.ПовторноеИспользованиеВозвращаемыхЗначений);
		Структура.Вставить("clientOrdinary", МД.КлиентОбычноеПриложение);
		Структура.Вставить("clientManaged", МД.КлиентУправляемоеПриложение);
		Результат.Добавить(Структура);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция Инструмент_MetadataListCommonForms()
	Результат = Новый Массив;
	Для Каждого МД Из Метаданные.ОбщиеФормы Цикл
		Результат.Добавить(Новый Структура("name", МД.Имя));
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция Инструмент_МетаданныеОписаниеОбъекта(Знач ПолноеИмяМД)
	Если ПустаяСтрока(ПолноеИмяМД) Тогда
		ВызватьИсключение "full_name не задан";
	КонецЕсли;
	ОбъектМД = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМД);
	Структура = мПолеТекстаПрограммы.ОбъектМДНапарника(ОбъектМД);
	Возврат Структура;
КонецФункции

Функция Инструмент_ОписаниеФормы(Знач ПолноеИмяФормы)
	Если ПустаяСтрока(ПолноеИмяФормы) Тогда
		ВызватьИсключение "full_name не задан";
	КонецЕсли;
	Форма = мПлатформа.ПассивнаяФормаПоИмениКэш(ПолноеИмяФормы);
	Структура = мПолеТекстаПрограммы.ФормаНапарника(Форма);
	Возврат Структура;
КонецФункции

//ирПортативный лФайл = Новый Файл(ИспользуемоеИмяФайла);
//ирПортативный ПолноеИмяФайлаБазовогоМодуля = Лев(лФайл.Путь, СтрДлина(лФайл.Путь) - СтрДлина("Модули\")) + "ирПортативный.epf";
//ирПортативный #Если Клиент Тогда
//ирПортативный 	Контейнер = Новый Структура();
//ирПортативный 	Оповестить("ирПолучитьБазовуюФорму", Контейнер);
//ирПортативный 	Если Не Контейнер.Свойство("ирПортативный", ирПортативный) Тогда
//ирПортативный 		ирПортативный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
//ирПортативный 		ирПортативный.Открыть();
//ирПортативный 	КонецЕсли;
//ирПортативный #Иначе
//ирПортативный 	ирПортативный = ВнешниеОбработки.Создать(ПолноеИмяФайлаБазовогоМодуля, Ложь); // Это будет второй экземпляр объекта
//ирПортативный #КонецЕсли
//ирПортативный ирОбщий = ирПортативный.ОбщийМодульЛкс("ирОбщий");
//ирПортативный ирКэш = ирПортативный.ОбщийМодульЛкс("ирКэш");
//ирПортативный ирСервер = ирПортативный.ОбщийМодульЛкс("ирСервер");
//ирПортативный ирКлиент = ирПортативный.ОбщийМодульЛкс("ирКлиент");

мПлатформа = ирКэш.Получить();
мПолеТекстаПрограммы = ирОбщий.СоздатьОбъектПоИмениМетаданныхЛкс("Обработка.ирКлсПолеТекстаПрограммы");
#Если Сервер И Не Сервер Тогда
	мПлатформа = Обработки.ирПлатформа.Создать();
	мПолеТекстаПрограммы = Обработки.ирКлсПолеТекстаПрограммы.Создать();
#КонецЕсли
#КонецЕсли
